; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v6)
             (pred_5 ?v1 ?v4)
             (pred_2 ?v10 ?v4)
             (pred_1 ?v8 ?v10 )
	     (pred_6 ?v10)
             (pred_11 ?v9)
             (pred_9 ?v1)
             (pred_8 ?v4)
             (pred_12 ?v10)
             (pred_7 ?v1)
             (pred_10 ?v10)
             (pred_4 ))



(:action op_3
:parameters (?v3 ?v7 ?v5 ?v12)
:precondition (and (pred_11 ?v3) (pred_11 ?v7) (pred_9 ?v5) (pred_8 ?v12)
          (pred_3 ?v3 ?v7) (pred_5 ?v5 ?v12)
                   (pred_2 ?v7 ?v12) (pred_6 ?v3) 
                   (pred_12 ?v7) (pred_7 ?v5))
:effect (and  (pred_10 ?v7) (not (pred_12 ?v7))))


(:action op_2
:parameters (?v3 ?v13)
:precondition (and (pred_11 ?v3) (pred_11 ?v13)
               (pred_6 ?v3) (pred_3 ?v3 ?v13) (pred_10 ?v13))
:effect (and (pred_6 ?v13) (not (pred_6 ?v3))))

(:action op_4
:parameters (?v3 ?v5)
:precondition (and (pred_11 ?v3) (pred_9 ?v5) 
                  (pred_6 ?v3) (pred_1 ?v5 ?v3) (pred_4 ))
:effect (and (pred_7 ?v5)
   (not (pred_1 ?v5 ?v3)) (not (pred_4 ))))


(:action op_1
:parameters (?v3 ?v2 ?v11)
:precondition (and (pred_11 ?v3) (pred_9 ?v2) (pred_9 ?v11)
                  (pred_6 ?v3) (pred_7 ?v11) (pred_1 ?v2 ?v3))
:effect (and (pred_7 ?v2) (pred_1 ?v11 ?v3)
        (not (pred_7 ?v11)) (not (pred_1 ?v2 ?v3))))

(:action op_5
:parameters (?v3 ?v5)
:precondition (and (pred_11 ?v3) (pred_9 ?v5) 
                  (pred_6 ?v3) (pred_7 ?v5))
:effect (and (pred_4 ) (pred_1 ?v5 ?v3) (not (pred_7 ?v5)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_26 obj_29 obj_18 obj_16 obj_02 obj_27 obj_24 obj_23 obj_20 obj_19 obj_14 obj_09 obj_25 obj_06 obj_03 obj_08 obj_28 obj_11 obj_32 obj_30 obj_31 obj_22 obj_07 obj_04 obj_01
    obj_12 obj_05 obj_10
    obj_15 obj_21 obj_17 obj_13
    )

    (:init
       (pred_4)

       (pred_11 obj_26)
       (pred_11 obj_29)
       (pred_11 obj_18)
       (pred_11 obj_16)
       (pred_11 obj_02)
       (pred_11 obj_27)
       (pred_11 obj_24)
       (pred_11 obj_23)
       (pred_11 obj_20)
       (pred_11 obj_19)
       (pred_11 obj_14)
       (pred_11 obj_09)
       (pred_11 obj_25)
       (pred_11 obj_06)
       (pred_11 obj_03)
       (pred_11 obj_08)
       (pred_11 obj_28)
       (pred_11 obj_11)
       (pred_11 obj_32)
       (pred_11 obj_30)
       (pred_11 obj_31)
       (pred_11 obj_22)
       (pred_11 obj_07)
       (pred_11 obj_04)
       (pred_11 obj_01)
       (pred_8 obj_12)
       (pred_8 obj_05)
       (pred_8 obj_10)
       (pred_9 obj_15)
       (pred_9 obj_21)
       (pred_9 obj_17)
       (pred_9 obj_13)

       (pred_3 obj_26 obj_27)
       (pred_3 obj_26 obj_29)
       (pred_3 obj_29 obj_24)
       (pred_3 obj_29 obj_18)
       (pred_3 obj_29 obj_26)
       (pred_3 obj_18 obj_23)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_29)
       (pred_3 obj_16 obj_20)
       (pred_3 obj_16 obj_02)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_02 obj_19)
       (pred_3 obj_02 obj_16)
       (pred_3 obj_27 obj_14)
       (pred_3 obj_27 obj_24)
       (pred_3 obj_27 obj_26)
       (pred_3 obj_24 obj_09)
       (pred_3 obj_24 obj_23)
       (pred_3 obj_24 obj_29)
       (pred_3 obj_24 obj_27)
       (pred_3 obj_23 obj_25)
       (pred_3 obj_23 obj_20)
       (pred_3 obj_23 obj_18)
       (pred_3 obj_23 obj_24)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_20 obj_16)
       (pred_3 obj_20 obj_23)
       (pred_3 obj_19 obj_03)
       (pred_3 obj_19 obj_02)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_14 obj_09)
       (pred_3 obj_14 obj_27)
       (pred_3 obj_09 obj_28)
       (pred_3 obj_09 obj_25)
       (pred_3 obj_09 obj_24)
       (pred_3 obj_09 obj_14)
       (pred_3 obj_25 obj_11)
       (pred_3 obj_25 obj_06)
       (pred_3 obj_25 obj_23)
       (pred_3 obj_25 obj_09)
       (pred_3 obj_06 obj_32)
       (pred_3 obj_06 obj_03)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_06 obj_25)
       (pred_3 obj_03 obj_30)
       (pred_3 obj_03 obj_19)
       (pred_3 obj_03 obj_06)
       (pred_3 obj_08 obj_31)
       (pred_3 obj_08 obj_28)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_28 obj_22)
       (pred_3 obj_28 obj_11)
       (pred_3 obj_28 obj_09)
       (pred_3 obj_28 obj_08)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_11 obj_32)
       (pred_3 obj_11 obj_25)
       (pred_3 obj_11 obj_28)
       (pred_3 obj_32 obj_04)
       (pred_3 obj_32 obj_30)
       (pred_3 obj_32 obj_06)
       (pred_3 obj_32 obj_11)
       (pred_3 obj_30 obj_01)
       (pred_3 obj_30 obj_03)
       (pred_3 obj_30 obj_32)
       (pred_3 obj_31 obj_22)
       (pred_3 obj_31 obj_08)
       (pred_3 obj_22 obj_07)
       (pred_3 obj_22 obj_28)
       (pred_3 obj_22 obj_31)
       (pred_3 obj_07 obj_04)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_07 obj_22)
       (pred_3 obj_04 obj_01)
       (pred_3 obj_04 obj_32)
       (pred_3 obj_04 obj_07)
       (pred_3 obj_01 obj_30)
       (pred_3 obj_01 obj_04)
       (pred_12 obj_11)
       (pred_12 obj_09)
       (pred_12 obj_25)
       (pred_12 obj_16)
       (pred_2  obj_11 obj_12)
       (pred_2  obj_09 obj_05)
       (pred_2  obj_25 obj_10)
       (pred_2  obj_16 obj_05)
       (pred_10 obj_26)
       (pred_10 obj_29)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_27)
       (pred_10 obj_24)
       (pred_10 obj_23)
       (pred_10 obj_20)
       (pred_10 obj_19)
       (pred_10 obj_14)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_28)
       (pred_10 obj_32)
       (pred_10 obj_30)
       (pred_10 obj_31)
       (pred_10 obj_22)
       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_01)

       (pred_5  obj_15 obj_12)
       (pred_5  obj_21 obj_05)
       (pred_5  obj_17 obj_10)
       (pred_5  obj_13 obj_10)
       (pred_1 obj_15 obj_04)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_13 obj_23)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_1 obj_15 obj_19)
       (pred_1 obj_17 obj_18)
    ))
(:constraints
  (always (not (pred_6 obj_20)))
)
)

; plan
1. (op_4 obj_03 obj_17)
   deleted: (pred_1 obj_17 obj_03) (pred_4)
   added: (pred_7 obj_17)
   goals met: 0 of 2
2. (op_2 obj_03 obj_06)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_06)
   goals met: 0 of 2
3. (op_2 obj_06 obj_32)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_32)
   goals met: 0 of 2
4. (op_5 obj_32 obj_17)
   deleted: (pred_7 obj_17)
   added: (pred_4) (pred_1 obj_17 obj_32)
   goals met: 0 of 2
5. (op_2 obj_32 obj_04)
   deleted: (pred_6 obj_32)
   added: (pred_6 obj_04)
   goals met: 0 of 2
6. (op_4 obj_04 obj_15)
   deleted: (pred_1 obj_15 obj_04) (pred_4)
   added: (pred_7 obj_15)
   goals met: 0 of 2
7. (op_2 obj_04 obj_32)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_32)
   goals met: 0 of 2
8. (op_2 obj_32 obj_06)
   deleted: (pred_6 obj_32)
   added: (pred_6 obj_06)
   goals met: 0 of 2
9. (op_5 obj_06 obj_15)
   deleted: (pred_7 obj_15)
   added: (pred_4) (pred_1 obj_15 obj_06)
   goals met: 0 of 2
10. (op_2 obj_06 obj_32)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_32)
   goals met: 0 of 2
11. (op_4 obj_32 obj_17)
   deleted: (pred_1 obj_17 obj_32) (pred_4)
   added: (pred_7 obj_17)
   goals met: 0 of 2
12. (op_2 obj_32 obj_06)
   deleted: (pred_6 obj_32)
   added: (pred_6 obj_06)
   goals met: 0 of 2
13. (op_1 obj_06 obj_15 obj_17)
   deleted: (pred_7 obj_17) (pred_1 obj_15 obj_06)
   added: (pred_7 obj_15) (pred_1 obj_17 obj_06)
   goals met: 0 of 2
14. (op_2 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_03)
   goals met: 0 of 2
15. (op_2 obj_03 obj_19)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_19)
   goals met: 0 of 2
16. (op_5 obj_19 obj_15)
   deleted: (pred_7 obj_15)
   added: (pred_4) (pred_1 obj_15 obj_19)
   goals met: 1 of 2
17. (op_2 obj_19 obj_03)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_03)
   goals met: 1 of 2
18. (op_2 obj_03 obj_06)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_06)
   goals met: 1 of 2
19. (op_4 obj_06 obj_17)
   deleted: (pred_1 obj_17 obj_06) (pred_4)
   added: (pred_7 obj_17)
   goals met: 1 of 2
20. (op_3 obj_06 obj_25 obj_17 obj_10)
   deleted: (pred_12 obj_25)
   added: (pred_10 obj_25)
   goals met: 1 of 2
21. (op_2 obj_06 obj_25)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_25)
   goals met: 1 of 2
22. (op_2 obj_25 obj_23)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_23)
   goals met: 1 of 2
23. (op_2 obj_23 obj_18)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_18)
   goals met: 1 of 2
24. (op_5 obj_18 obj_17)
   deleted: (pred_7 obj_17)
   added: (pred_4) (pred_1 obj_17 obj_18)
   goals met: 2 of 2
